[["Bitcoin Flash Crash Roils Crypto Market", "Crypto prices dipped Monday following a so-called flash crash of Bitcoin on Sunday. And while Ethereum dipped as well, the second most popular cryptocurrency is still up significantly on the month.\r\n… [+3991 chars]", "https://gizmodo.com/bitcoin-price-flash-crash-ether-thiel-2000647613"], ["Does Bitcoin Belong on Your Balance Sheet?", "This year, mainstream corporate finance has become embroiled in a debate that would have felt unthinkable even a few years ago: How much crypto belongs on your balance sheet? Bitcoins latest ralliesn… [+529 chars]", "https://hbr.org/2025/09/does-bitcoin-belong-on-your-balance-sheet"], ["Trump Family’s Crypto Token Just Made Them $5 Billion Richer", "The Trump family just became $5 billion richer (on paper) thanks to its latest crypto venture.\r\nThe Trumps new digital currency WLFI began trading on Monday with about $1 billion worth of the tokens … [+4273 chars]", "https://gizmodo.com/trump-family-cryptocurrency-5-billion-richer-wlfi-price-2000652197"], ["Bitcoin transaction fees are in free fall. This report explains why", "Bitcoin transaction fees have collapsed to near-historic lows even as its price sits close to all time highs, creating an unusual situation that challenges conventional wisdom.\r\nWill Owens from Galax… [+9487 chars]", "https://blockspace.media/insight/bitcoin-transaction-fees-are-in-free-fall-this-report-explains-why/"], ["BlackRock Continues to Offload Millions in Bitcoin, Ethereum, But for How Long?", "BlackRock is the world’s largest asset manager and the leading institution in Bitcoin and Ethereum exchange-traded funds (ETFs), offering via iShares products IBIT and ETHA, traded on Nasdaq. Differe… [+2992 chars]", "https://www.coinspeaker.com/blackrock-continues-to-offload-millions-in-bitcoin-ethereum-but-for-how-long/"], ["China Turns Legacy Chips Into a Trade Weapon", "While the Trump administration was trying to make a TikTok deal happen during a meeting with China last weekend, Beijing was busy adding its own bargaining chips to the table. Actual chips, in factse… [+3830 chars]", "https://www.wired.com/story/china-probe-us-chip-makers-tiktok-deal/"], ["The US and China might finally have a TikTok deal", "<ul><li></li><li></li><li></li></ul>\r\nTikTok has until September 17th to reach a deal or face a ban in the US.\r\nTikTok has until September 17th to reach a deal or face a ban in the US.\r\nby\r\nEmma Roth… [+3451 chars]", "https://www.theverge.com/news/778087/tiktok-ban-framework-deal-us-china-trump"], ["China Is Building a Brain-Computer Interface Industry", "Given these and other recent milestones, Peng says its realistic to think that at least one BCI system could gain approval in China by 2027.\r\nMinmin Luo, director of the Chinese Institute for Brain R… [+2695 chars]", "https://www.wired.com/story/china-is-getting-serious-about-brain-computer-interfaces/"], ["China Is About to Show Off Its New High-Tech Weapons to the World", "China is preparing for one of the most anticipated and politically charged military events in recent years. On September 3, in Tiananmen Square, China will celebrate the 80th anniversary of the victo… [+7146 chars]", "https://www.wired.com/story/china-victory-day-parade-weapons/"], ["The China-US deal for TikTok could take another month to work out", "<ul><li></li><li></li><li></li></ul>\r\nTreasury Secretary Scott Bessent said a framework deal has been reached, but CNBC reports that it will take a while to finalize.\r\nTreasury Secretary Scott Bessen… [+3181 chars]", "https://www.theverge.com/news/778789/tiktok-us-china-deal-investors-oracle"]]