["A former hedge fund manager was charged by Manhattan federal prosecutors with defrauding several Harvard Business School classmates and others in his social circle of more than $4 million.\r\nVladimir … [+336 chars]", "The Senate confirmed 48 of President Donald Trump's nominees in a single vote on Thursday after the Republican majority triggered the \"nuclear option\" to make a far-reaching rule change.\r\nThe party-l… [+3411 chars]", "At the centre of this growing controversy are Jimmy Kimmel's remarks about the shooting of conservative activist Charlie Kirk.\r\nThe late-night host claimed on Monday that Donald Trump's \"Maga\" suppor… [+1292 chars]", "The man who gunned down three detectives in central Pennsylvania had been wanted for allegedly stalking a former girlfriend and broke into her house before ambushing the lawmen, authorities said Thur… [+3319 chars]", "{\"en\":{\"access_disabled\":\"Internet access has been disabled on this device\",\"code\":\"Code\",\"custom_block_list\":\"it is on a custom block list\",\"email\":\"Email\",\"file_ext_blocked\":\"the file extension is … [+4327 chars]", "Nvidia, the semiconductor company powering the artificial intelligence revolution, said Thursday that it was buying a $5 billion stake in ailing rival Intel.\r\nThe two companies will also begin a part… [+2980 chars]", "<ul><li></li><li></li><li></li></ul>\r\nHyundai CEO José Muñoz clarified that the immigration raid that resulted in the arrest of hundreds of South Koreans had targeted a facility operated by LG Energy… [+4427 chars]", "The Federal Trade Commission filed a lawsuit\r\n against Ticketmaster and its parent company, Live Nation, on Thursday, alleging that the company willingly misleads consumers about ticket prices and co… [+3369 chars]", "In the week since conservative activist Charlie Kirk was assassinated at a Utah university event, comments from some of his critics have ignited a battle over free speech in an increasingly polarized… [+13842 chars]"]