[["Equities Boom on Fed Interest Rate Cut", "Top 10 Creations (All ETFs)\r\n<table><tr><td>Ticker\r\n</td><td>Name\r\n</td><td>Net Flows ($, mm)\r\n</td><td>AUM ($, mm)\r\n</td><td>AUM % Change\r\n</td></tr><tr><td>VUG\r\n</td><td>Vanguard Growth ETF\r\n</td><… [+3932 chars]", "http://www.etf.com/sections/daily-etf-flows/equities-boom-fed-interest-rate-cut?utm_source=yahoo-finance&amp;utm_medium=rss&amp;utm_campaign=yahoo-finance-rss"], ["Nvidia's Earnings Could Make Or Break Momentum ETFs", "Benzinga and Yahoo Finance LLC may earn commission or revenue on some items through the links below.\r\nA sudden tumble in the high-flying factor names could be paving the way for a reversal, say Goldm… [+2461 chars]", "https://finance.yahoo.com/news/nvidias-earnings-could-break-momentum-033106874.html"], ["Comfort Systems USA (FIX) Reported Blowout Results in Q2", "TimesSquare Capital Management, an equity investment management company, released its U.S. Small Cap Growth Strategy second-quarter 2025 investor letter. A copy of the letter can be downloaded here. … [+2502 chars]", "https://finance.yahoo.com/news/comfort-systems-usa-fix-reported-131012150.html"], ["Comfort Systems USA (FIX) Continued to Benefit from Increasing Focus on AI", "ClearBridge Investments, an investment management company, released its ClearBridge Select Strategy second-quarter 2025 investor letter. A copy of the letter can be downloaded here. U.S. equities str… [+2543 chars]", "https://finance.yahoo.com/news/comfort-systems-usa-fix-continued-123516488.html"], ["Trump has bought $100M in bonds since entering White House, report says. Get on ‘winning’ side of his big bet", "President Donald Trump has quietly purchased at least $103 million in corporate and municipal bonds since taking office in January, according to NBC News. [1]\r\nThe filings from the U.S. Office of Gov… [+5184 chars]", "https://finance.yahoo.com/news/trump-bought-100m-bonds-since-130000559.html"], ["EU faces worst wildfire season on record", "Erwan RivaultData Designer, BBC Verify\r\nUnprecedented wildfires have scarred northern Spain in recent weeks\r\nA record one million hectares - equivalent to about half the land area of Wales - have bur… [+5778 chars]", "https://www.bbc.com/news/articles/cd6n8qqlj8go"], ["No Eze but Palace welcome new era on a bittersweet night", "There had been fears after Crystal Palace's FA Cup win that they would struggle to keep their talented squad together.\r\nEze's departure has felt inevitable for some time but, so far, they have done w… [+1507 chars]", "https://www.bbc.com/sport/football/articles/c4g6l0re531o"], ["Uber and Momenta will test fully driverless cars in Germany", "<ul><li></li><li></li><li></li></ul>\r\nThe tests are a precursor to the companies plan to launch a robotaxi service in 2026.\r\nThe tests are a precursor to the companies plan to launch a robotaxi servi… [+3020 chars]", "https://www.theverge.com/news/772639/uber-momenta-l4-driverless-test-munich-robotaxi"], ["TCL gives parents a monochrome mode to combat kids’ phone addiction", "<ul><li></li><li></li><li></li></ul>\r\nThe Nxtpaper 5G Junior has an E Ink-esque display to help manage screentime.\r\nThe Nxtpaper 5G Junior has an E Ink-esque display to help manage screentime.\r\nTCL h… [+3224 chars]", "https://www.theverge.com/news/768556/tcl-nxtpaper-5g-junior-ifa-e-reader-kids-phone"], ["Sony’s new Xperia phone jumps on the camera bar bandwagon", "<ul><li></li><li></li><li></li></ul>\r\nThe Xperia 10 VII is the latest phone to borrow the Pixel look.\r\nThe Xperia 10 VII is the latest phone to borrow the Pixel look.\r\nSony has announced the Xperia 1… [+3684 chars]", "https://www.theverge.com/news/777002/sony-xperia-10-vii-phone-design-specs-price"], ["Tech Utopians Are Using a Chinese-Built ‘Ghost City’ to Trial Their Network State Fantasies", "For the better part of a decade, tech investor Balaji Srinivasan has been calling for Silicon Valley to secede from the rest of the United States. The free-market tech guru doesnt just want space fro… [+3863 chars]", "https://gizmodo.com/tech-utopians-are-using-a-chinese-built-ghost-city-to-trial-their-network-state-dreams-2000652052"], ["How to See the Total Lunar Eclipse and Blood Moon on September 7", "On the evening of September 7, the second (and final) total lunar eclipse of the year will take placeserving up the striking sight of a red blood moon in the sky across much of the world.\r\nTotal luna… [+2415 chars]", "https://www.wired.com/story/how-to-see-the-total-lunar-eclipse-and-blood-moon-on-september-7/"], ["These Smoked Human Remains May be the Oldest Mummies Known to Science", "Researchers have discovered what they believe to be the earliest evidence of artificial mummification known to science, pushing back the timeline for the burial ritual to far before the time of the a… [+3384 chars]", "https://gizmodo.com/these-smoked-human-remains-may-be-the-oldest-mummies-known-to-science-2000660302"], ["Nepal turmoil adds to India's woes in South Asia", "Anbarasan EthirajanGlobal Affairs Reporter\r\nNepal has become the third country in India's immediate neighbourhood to see a violent uprising topple its government in recent years. \r\nPrime Minister KP … [+5995 chars]", "https://www.bbc.com/news/articles/c8xrqld50dko"], ["Sony’s new Xperia phone jumps on the camera bar bandwagon", "<ul><li></li><li></li><li></li></ul>\r\nThe Xperia 10 VII is the latest phone to borrow the Pixel look.\r\nThe Xperia 10 VII is the latest phone to borrow the Pixel look.\r\nSony has announced the Xperia 1… [+3684 chars]", "https://www.theverge.com/news/777002/sony-xperia-10-vii-phone-design-specs-price"], ["The Hidden Cost of Rushing into Emerging Markets", "Emerging markets are increasingly important for multinational companies (MNCs), but entering these markets can be a difficult and costly experience. As interest in emerging markets grows, so too has … [+383 chars]", "https://hbr.org/2025/09/the-hidden-cost-of-rushing-into-emerging-markets"], ["Ken Griffin's policies-over-politics mantra is on full display in the billionaire's latest break with Trump", "\"Right here? Right now? The election is tomorrow? He wins it,\" Citadel founder and CEO Ken Griffin said of former President Donald Trump's bid for the White House.Vernon Yuen/NurPhoto via Getty Image… [+3528 chars]", "https://www.businessinsider.com/ken-griffin-criticizes-trump-administration-federal-reserve-2025-9"], ["A new way to spot tremors in prediction markets", "A scene from the 1990 movie, \"Tremors\" Universal\r\n<ul><li>This post originally appeared in the BI Tech Memo newsletter.</li><li>Sign up for the weekly BI Tech Memo newsletter here.</li></ul>Former In… [+2317 chars]", "https://www.businessinsider.com/polymarket-spot-tremors-prediction-markets-ai-2025-9"], ["Walmart is emerging as an AI powerhouse with one big advantage", "A worker at a Walmart automated distribution center.Walmart\r\n<ul><li>Walmart is using AI to solve vast and complicated physical challenges.</li><li>The company's mix of digital and physical operation… [+4133 chars]", "https://www.businessinsider.com/why-walmart-is-emerging-as-an-ai-powerhouse-2025-9"], ["Here’s Why Crypto Set the Market on Fire Yesterday", "Cryptocurrency markets skyrocketed into new territory Friday after Federal Reserve Chair Jerome Powell signaled that interest rate reductions could be imminent, pushing the Dow to its first 800-point… [+5589 chars]", "https://gizmodo.com/crypto-rally-powell-speech-2000647235"], ["Goldman Sachs says we’re on the verge of a stablecoin gold rush worth trillions", "<ul><li>Goldman Sachs and U.S. Treasury Secretary Scott Bessent expect a stablecoin gold rush, driven by new regulations and massive potential for payment market expansion. Stablecoins, which must be… [+4466 chars]", "https://finance.yahoo.com/news/goldman-sachs-says-verge-stablecoin-104117655.html"], ["Investors wary of Treasury's 30-year bond auction after recent disappointments", "By Gertrude Chavez-Dreyfuss\r\nNEW YORK (Reuters) -Investors are cautiously approaching the U.S. Treasury's sale of $22 billion in 30-year bonds on Thursday after an underwhelming auction last month th… [+3858 chars]", "https://ca.finance.yahoo.com/news/investors-wary-treasurys-30-bond-143123318.html"], ["Long Bond Selloff Hits Japan as Yields Hit Multi-Decade Highs", "Japan's longer-maturity debt slumped, sending yields to multi-decade highs, following a global selloff in bonds and political uncertainty in the nation. Yields on 20-year government bonds rose to lev… [+242 chars]", "https://finance.yahoo.com/video/long-bond-selloff-hits-japan-055208511.html"], ["'Upside down economically': Here's why the housing market probably won't get more affordable if the Fed cuts rates", "Don't expect the Fed to rescue the housing market.\r\nMarkets have their eye on the Fed's likely interest rate cut in September, but Peter Boockvar, the CIO of One Point BFG Wealth Partners, has a two-… [+3083 chars]", "https://www.businessinsider.com/housing-market-mortgage-rates-outlook-fed-rate-cuts-home-prices-2025-8"], ["The Middle East is competing for wealthy expats with a surge of 'golden visas'", "Oman has launched a $520,000 golden visa, joining a Gulf race to attract wealthy expats.Bildagentur-online/Universal Images Group via Getty Images\r\n<ul><li>Oman has become the latest Gulf state to jo… [+3423 chars]", "https://www.businessinsider.com/middle-east-races-for-wealthy-expats-with-surge-golden-visas-2025-9"], ["BIS warns of mounting disconnect between debt and stock markets", "By Marc Jones\r\nLONDON (Reuters) -The Bank for International Settlements has warned that record global share prices appear increasingly disconnected from the rising concerns about government debt leve… [+2940 chars]", "https://ca.finance.yahoo.com/news/bis-warns-mounting-disconnect-between-111823393.html"], ["Corporate credit demand likely to revive this quarter, says SBI MD", "Banks are likely to see a revival in corporate credit demand this quarter with bond yields hardening making debt capital relatively unattractive for India Inc in comparison to the situation seen in t… [+2349 chars]", "https://economictimes.indiatimes.com/industry/banking/finance/banking/corporate-credit-demand-likely-to-revive-this-quarter-says-sbi-md/articleshow/123819409.cms"], ["Corporate bond re-rating to be gradual but meaningful; high-grade issuers may move closer to AAA: Saurav Ghosh of Jiraaf", "The recent sovereign rating upgrade has set the stage for a slow but steady re-pricing in Indias corporate bond market.According to Saurav Ghosh, Co-founder of Jiraaf, while the impact will not be im… [+8312 chars]", "https://economictimes.indiatimes.com/markets/bonds/corporate-bond-re-rating-to-be-gradual-but-meaningful-high-grade-issuers-may-move-closer-to-aaa-saurav-ghosh-of-jiraaf/articleshow/123386161.cms"], ["Sovereign upgrade, index flows and GST reform create a strong bond market backdrop: Chirag Doshi, LGT Wealth India", "Indias bond market is entering a supportive phase, buoyed by a rare confluence of tailwinds.The recent sovereign rating upgrade by S&amp;P, coupled with ongoing index inclusions and the governments p… [+7398 chars]", "https://economictimes.indiatimes.com/markets/bonds/sovereign-upgrade-index-flows-and-gst-reform-create-a-strong-bond-market-backdrop-chirag-doshi-lgt-wealth-india/articleshow/123391838.cms"], ["Pope Leo Condemns Large Corporate Pay Packages Of Elon Musk And Other CEOs: “We Are In Big Trouble”", "Pope Leo has criticized the widening corporate pay gap between executives and their workers in his first interview since ascending to the papacy.\r\nThe interview was released Sunday on the Catholic ne… [+1569 chars]", "http://deadline.com/2025/09/pope-leo-corporate-pay-elon-musk-1236538487/"], ["$1B Powerball is Minting Social Media Gold", "Powerball just hit a billion dollars, and people are freaking out about it.\r\nFor 39 draws in a row, no ticket matched all six numbers for the Powerball jackpot. The last draw was on Saturday night.\r\n… [+4334 chars]", "https://gizmodo.com/powerball-drawing-2000651371"], ["How the Casting of ‘Andor’ Brought More Powerful Women to ‘Star Wars’", "The extraordinary ensemble seen in Andor exemplified the best of Star Wars and brought more iconic heroes and villains to the franchise in two unforgettable seasons. Led by Genevieve O’Reilly, repris… [+4729 chars]", "https://gizmodo.com/how-the-casting-of-andor-brought-more-powerful-women-to-star-wars-2000645285"], ["Florida man orders beautification of America after gold-plating the White House", "<ul><li></li><li></li><li></li></ul>\r\nMake America Design Again.\r\nMake America Design Again.\r\nby\r\nJess WeatherbedClose\r\nJess Weatherbed\r\nPosts from this author will be added to your daily email diges… [+2092 chars]", "https://www.theverge.com/news/764142/trump-executive-order-national-design-studio"], ["Hodgkinson eyes golden finish to 'most challenging year'", "To that extent, Hodgkinson views everything which could follow as a bonus.\r\nThe challenges of the past year have provided a sense of freedom rarely granted to Olympic champions - and which she is unl… [+1052 chars]", "https://www.bbc.com/sport/athletics/articles/c4g6z1kggrvo"], ["South Korean man arrested in Thailand in $50 million crypto scam", "A South Korean man was arrested in Bangkok, Thailand on Saturday, accused of laundering over $50 million worth of cryptocurrency into physical gold bars in the span of just three months.\r\nThe man, id… [+2592 chars]", "https://gizmodo.com/south-korean-man-50-million-crypto-scam-2000647369"], ["New Design for Comfortable, Lightweight, Sound-Transparent Full-Face Respirator", "I own a 3M FX full-face respirator that is invaluable for certain tasks. \r\nThe protection is excellent. However, the mask is uncomfortably hot and cumbersome, it can fog up in certain conditions, and… [+1445 chars]", "https://www.core77.com/posts/138622/New-Design-for-Comfortable-Lightweight-Sound-Transparent-Full-Face-Respirator"], ["Hong Kong-Singapore Are Quietly Building A Regulated Token Corridor", "Singapore and Hong Kong have positioned themselves as tokenized innovation centers, but this will only accelerate as linkages grow. (ROSLAN RAHMAN/AFP via Getty Images)\r\nAFP via Getty Images\r\nIf you … [+8602 chars]", "https://www.forbes.com/sites/digital-assets/2025/09/15/hong-kong-singapore-are-quietly-building-a-regulated-token-corridor/"], ["Ant International completes FX blockchain settlement in Asia via JPMorgan's Kinexys", "Ant International has successfully completed one of the first near-instant USD to EUR FX onchain cross-border payments in Asia through Kinexys Digital Payments.The solution provides businesses with u… [+2221 chars]", "https://www.finextra.com/pressarticle/106882/ant-international-completes-fx-blockchain-settlement-in-asia-via-jpmorgans-kinexys"], ["BOSS PX-1 Plugout FX Features 16 Effects In One Pedal", "BOSS has introduced the PX-1 Plugout FX, a new effects pedal that lets you select from up to 16 effects.\r\nThe BOSS PX-1 Plugout FX features multiple effects, based on classic BOSS pedals, stereo inpu… [+885 chars]", "https://www.synthtopia.com/content/2025/08/29/boss-px-1-plugout-fx-features-16-effects-in-one-pedal/"], ["Stablecoins Aren’t Just For Crypto Trading Anymore", "(Original Caption) San Diego: The 987-foot, 30,000-ton supertanker Exxon Mediterranean formerly the Exxon Valdez famous for its part in the largest oil spill in U. S. history 3/24/89 when it ran into… [+5459 chars]", "https://www.forbes.com/sites/astanley/2025/09/16/stablecoins-arent-just-for-crypto-trading-anymore/"], ["Trump urges Putin-Zelenskiy meeting, tells Europe to stop buying Russian oil", "Investing.com -- U.S. President Donald Trump has called for Russian President Vladimir Putin and Ukrainian President Volodymyr Zelenskiy to meet, suggesting there could be consequences if they fail t… [+779 chars]", "https://www.yahoo.com/news/articles/trump-urges-putin-zelenskiy-meeting-144123094.html"], ["Samsung 870 QVO 4TB SATA SSD-s: how are they doing after 4 years of use?", "I’ve been running four Samsung 870 QVO 4TB SATA SSD-s for a while now. They’re old enough to be popping up on the\r\nsecond-hand market, so I thought it would be good to provide a few additional data p… [+1765 chars]", "https://ounapuu.ee/posts/2025/09/15/samsung-870-qvo/"], ["Loewe Technology Taps Jacob & Co. for Iced-Out Headphones", "Summary\r\n<ul><li>German tech company Loewe has partnered with jeweller Jacob &amp; Co. for bespoke, diamond-encrusted headphones.</li><li>The limited-edition device comes in two signature finishes, w… [+1191 chars]", "https://hypebeast.com/2025/8/loewe-jacob-and-co-headphones-collaboration-release-info"], ["Upcoming Leitz Auction To Feature Pope Francis’ One-Of-A-Kind Leica M-A", "Summary\r\n<ul><li>Leicas silver-chrome M-A no. 5000000 Pope Francis with Noctilux lens to headline Leitz Auction 47</li><li>White and gold enamel engravings feature the Keys of Peter, papal motto and … [+1576 chars]", "https://hypebeast.com/2025/9/pope-francis-leica-m-a-no-5000000-leitz-photographica-auction-info"], ["The Broken Arm and Salomon Debuts the Quietly Rugged Pastoral Shoe", "Name: The Broken Arm x Salomon PastoralColorway: Green Haze/Black Forest/Haute RedSKU: L47969000MSRP: 220 EUR (approx. $257 USD)Release Date: September 15Where to Buy:The Broken Arm, Salomon\r\nThe Bro… [+624 chars]", "https://hypebeast.com/2025/9/the-broken-arm-salomon-pastoral-l47969000-release-info"], ["De Bethune Debuts a Duo of DB28xs Timepieces Ahead of Geneva Watch Days 2025", "Summary\r\n<ul><li>De Bethune unveils two new DB28xs timepieces ahead of Geneva Watch Days 2025</li><li>Both the DB28xs Kind of Blue Tourbillon and DB25xs Starry Varius feature smaller, more compact ca… [+1812 chars]", "https://hypebeast.com/2025/9/de-bethune-db28xs-kind-of-blue-tourbillon-starry-varius-geneva-watch-days-release-info"], ["MING’s 57.04 Iris Marks Its First Left-Handed Chronograph", "Summary\r\n<ul><li>The MING 57.04 Iris watch debuts the brand’s fifth-generation design language</li><li>It is a 40mm stainless steel destro monopusher chronograph with an iridescent, color-shifting di… [+1526 chars]", "https://hypebeast.com/2025/8/ming-57-04-iris-destro-chronograph-8th-anniversary-limited-edition-release-info"], ["Swiss Destro Chronograph Uses Color-Shifting Technology to Transform Traditional Watchmaking Into Living Art", "Every watch collector knows that terrible moment when you fall in love with a timepiece that costs more than your car. The independent watch world has tortured enthusiasts for years with stunning chr… [+9519 chars]", "https://www.yankodesign.com/2025/08/27/swiss-destro-chronograph-uses-color-shifting-technology-to-transform-traditional-watchmaking-into-living-art/"], ["MB&F collaborates with artist Yinka Ilori for colourful trio of M.A.D.1S ‘Grow Your Dreams’ watches", "The horological marvels from MB&amp;F are way beyond most of us. Thankfully, now M.A.D.Editions is making the complications and watchmaking superiority of an MB&amp;F readily available for the mid-se… [+3062 chars]", "https://www.yankodesign.com/2025/08/27/mbf-collaborates-with-artist-yinka-ilori-for-colourful-trio-of-m-a-d-1s-grow-your-dreams-watches/"], ["HMD Pulse 2 Pro listed with key specs", "Just ahead of IFA 2025, HMDs Pulse 2 Pro managed to leak thanks to a listing by a Swiss retailer. The listing comes with detailed specs and images confirming all there is to know about the upcoming b… [+988 chars]", "https://www.gsmarena.com/hmd_pulse_2_pro_listed_with_key_specs_-news-69298.php"], ["Brooks Brothers and eYe Junya Watanabe MAN Reunite for FW25 Capsule", "Summary\r\n<ul><li>Brooks Brothers and eYe Junya Watanabe MAN reunited for a Fall/Winter 2025 capsule</li><li>The collection includes a nylon-fused blazer, a button-down shirt, and wide chino trousers<… [+937 chars]", "https://hypebeast.com/2025/9/brooks-brothers-eye-junya-watanabe-man-fall-winter-fw-25-collection-release-info"], ["Wrangler and Converse Japan Debut Duo of All Star Aged Hi Models", "Name: Wrangler x Converse All Star Aged HiColorway: Indigo, RedSKU: 31315590210, 31315600210MSRP: ¥12,100 JPY (approximately $80 USD), ¥15,400 JPY (approximately $100 USD)Release Date: September 12Wh… [+1187 chars]", "https://hypebeast.com/2025/9/wrangler-and-converse-japan-debut-duo-of-all-star-aged-hi-models"], ["C.P. Company Reunites With Sashiko Gals To Create One-Of-A-Kind Designs", "Summary\r\n<ul><li>C.P. Company and Sashiko Gals release a new collaboration featuring one-of-a-kind military-inspired archive pieces</li><li>The collection incorporates traditional Japanese “Sashiko” … [+1493 chars]", "https://hypebeast.com/2025/9/c-p-company-sashiko-gals-collaboration-release-info"], ["B:MING by BEAMS and Clarks Originals Debut Elevated Leather Wallabee Boot", "Name: B:MING by BEAMS x Clarks Originals Wallabee BootColorway: Dark Tan CombiSKU: 92-32-0095-100MSRP: ¥27,500 JPY (approximately $185 USD)Release Date: Available nowWhere to Buy:Beams.co.jp\r\nB:MING … [+468 chars]", "https://hypebeast.com/2025/8/b-ming-by-beams-clarks-originals-wallabee-boot-dark-tan-combi-92-32-0095-100-release-info"], ["GEEKS RULE Gears for ‘Chainsaw Man - The Movie: Reze Arc’ With Exclusive Graphic Tees", "Name:Chainsaw Man – The Movie: Reze Arc × GEEKS RULE 15 Silkscreen Printing T-Shirt vol.01MSRP: ¥12,100 JPY (approx. $83 USD)Release Date: September 20Where to Buy:GEEKS RULE, GR8\r\nGEEKS RULE has unv… [+445 chars]", "https://hypebeast.com/2025/9/geeks-rule-chainsaw-man-the-movie-reze-arc-graphic-t-shirt-collaboration-release-info"], ["Here’s Why Crypto Set the Market on Fire Yesterday", "Cryptocurrency markets skyrocketed into new territory Friday after Federal Reserve Chair Jerome Powell signaled that interest rate reductions could be imminent, pushing the Dow to its first 800-point… [+5589 chars]", "https://gizmodo.com/crypto-rally-powell-speech-2000647235"], ["Massive Supply Chain Attack Targets Cryptocurrencies Through NPM", "A phishing attack aimed at a particular software maintainer’s account has managed to compromise software packages that have over 2.6 billion weekly downloads. BleepingComputer, noting that the infect… [+2495 chars]", "https://gizmodo.com/massive-supply-chain-attack-targets-cryptocurrencies-through-npm-2000655610"], ["Bitcoin Flash Crash Roils Crypto Market", "Crypto prices dipped Monday following a so-called flash crash of Bitcoin on Sunday. And while Ethereum dipped as well, the second most popular cryptocurrency is still up significantly on the month.\r\n… [+3991 chars]", "https://gizmodo.com/bitcoin-price-flash-crash-ether-thiel-2000647613"], ["BlackRock Continues to Offload Millions in Bitcoin, Ethereum, But for How Long?", "BlackRock is the world’s largest asset manager and the leading institution in Bitcoin and Ethereum exchange-traded funds (ETFs), offering via iShares products IBIT and ETHA, traded on Nasdaq. Differe… [+2992 chars]", "https://www.coinspeaker.com/blackrock-continues-to-offload-millions-in-bitcoin-ethereum-but-for-how-long/"], ["$3.38 Billion in Bitcoin Options Expiry Raises Concerns of September Volatility", "With $3.38 billion of Bitcoin options expiry on Sept. 5, BTC price is showing some strength with 1.77% upside. Now it has increased to $112,500 levels. Analysts are expecting September to be a month … [+2102 chars]", "https://www.coinspeaker.com/3-8-billion-in-bitcoin-options-expiry-raises-concerns-of-september-volatility/"]]