[["10 Friday AM Reads", "How to Build a Million-Dollar Future for Your Kids: Setting your child up for life doesnt require a windfall just time, consistency and a willingness to think beyond bonds and birthday cards. (Bloomb… [+2764 chars]", "https://ritholtz.com/2025/09/10-friday-am-reads-467/", "2025-09-19T10:30:41Z"], ["Long Bonds Are a Buy as Contagion Fears Ease, TS Lombard Says", "{ window.open(this.href, '_blank'); }, 200); return false;\"&gt;Why did Nvidia invest $5B in Intel? { window.open(this.href, '_blank'); }, 200); return false;\"&gt;What caused ABC to suspend Jimmy Kimm… [+726 chars]", "https://biztoc.com/x/83a69e15c180b684", "2025-09-19T03:53:46Z"], ["Morgan and Williams named Wales players of the year", "Morgan will be a key figure for club and country in the coming months and hopes to reap the rewards from working alongside the likes of Maro Itoje, Tadhg Beirne, Jack Conan and Tom Curry.\r\n\"The Lions… [+1253 chars]", "https://www.bbc.com/sport/rugby-union/articles/cq5j3nxne0eo", "2025-09-19T08:59:06Z"], ["One AI safety guru claims that OpenAI's management could spark a global disaster — \"Everyone will die\" if trends continue", "Over the past few months, concerns have been high around AI safety and privacy amid rising incidents of minors committing suicide after reportedly forming unhealthy bonds and relationships with AI to… [+4425 chars]", "https://www.windowscentral.com/artificial-intelligence/ai-safety-guru-claims-openai-management-could-spark-global-disaster", "2025-09-19T11:20:00Z"], ["Are Magnificent 7 stocks overpriced? Here are alternatives.", "If you know anything about stocks, youve probably heard of the Magnificent Seven.\r\nSeven tech giants Amazon, Apple, Alphabet (Google), Meta, Microsoft, Nvidia and Tesla have driven massive gains on W… [+5768 chars]", "https://www.usatoday.com/story/money/2025/09/19/magnificent-seven-stocks-nvidia-microsoft-apple-sp500/86224670007/", "2025-09-19T09:03:57Z"], ["The Psychology Of Trust In AI: A Guide To Measuring And Designing For User Confidence", "Misuse and misplaced trust of AI is becoming an unfortunate common event. For example, lawyers trying to leverage the power of generative AI for research submit court filings citing multiple compelli… [+28850 chars]", "https://www.smashingmagazine.com/2025/09/psychology-trust-ai-guide-measuring-designing-user-confidence/", "2025-09-19T10:00:00Z"], ["Bank of Japan's Historic ETF Unwind Sparks Market Sell-Off, Dip in Crypto", "The Bank of Japan (BOJ) spooked markets Friday by announcing it will begin unwinding its $250 billion in exchange traded funds (ETFs) and Japanese Real Estate Investment Trusts (JREITs), assets it ac… [+1116 chars]", "https://www.coindesk.com/markets/2025/09/19/bank-of-japan-s-historic-etf-unwind-sparks-market-selloff-dip-in-crypto", "2025-09-19T14:43:04Z"], ["Blackstone names Keenan real estate income trust CEO after LePatner's fatal shooting", "(Reuters) - Blackstone named insider Katie Keenan as the CEO of its real estate income trust and global head of the Core+ business, the company said on Friday, following the fatal shooting of the for… [+1228 chars]", "https://finance.yahoo.com/news/katie-keenan-appointed-ceo-blackstone-125157704.html", "2025-09-19T12:51:57Z"], ["Inside Palantir: Profits, Power and the Kill Machine", "One of the most defining images of Trumps second inauguration was the tech overlords filing up to declare their allegiance. Perhaps this line up was a demonstration that they wield great powers too. … [+32028 chars]", "https://citizensreunited.substack.com/p/inside-palantir-profits-power-and", "2025-09-19T00:40:04Z"], ["What Luka Doncic's dominant summer could mean for Lakers -- and the rest of the NBA", "THE INTERMITTENT FASTING was put on hold for a few hours.\r\nAs the dishes were served in Katowice, Poland -- a salad for Los Angeles Lakers governor Jeanie Buss; fish for Lakers president of basketbal… [+8943 chars]", "https://www.espn.com/nba/story/_/id/46303877/los-angeles-lakers-luka-doncic-eurobasket-offseason-2025-26-season", "2025-09-19T12:52:01Z"]]