[["Apple's new iPhone 17 is available. Will users upgrade devices?", "Let's turn now to our stock of the day. Apple's new iPhone 17 and iPhone Air are officially available for consumers starting today. And according to research from start.io, the single most widely own… [+3366 chars]", "https://finance.yahoo.com/video/apples-iphone-17-available-users-142810488.html", "2025-09-19T14:28:10Z"], ["China Market Update: Growth Stocks Grind Higher In Hong Kong, Week In Review", "<ul><li>Asian equities were mostly higher this week as Hong Kongs Hang Seng Tech Index, the Philippines, and Indonesia outperformed, while Mainland Chinas Shanghai Composite Index and Australia under… [+5239 chars]", "https://www.forbes.com/sites/brendanahern/2025/09/19/china-market-update-growth-stocks-grind-higher-in-hong-kong-week-in-review/", "2025-09-19T16:31:10Z"], ["Kraken taps Trust Wallet to expand Backed xStocks’ tokenized equities", "Crypto exchange Kraken, the main distribution partner for Backeds tokenized equities product xStocks, has partnered with Trust Wallet, one of the worlds largest self-custody crypto wallets, to extend… [+2758 chars]", "https://cointelegraph.com/news/kraken-trust-wallet-tokenized-equities", "2025-09-19T12:37:58Z"], ["Galaxy Digital (GLXY): A Bull Case Theory", "We came across a bullish thesis on Galaxy Digital on wallstreetbets subreddit by CheekEquivalent1277. In this article, we will summarize the bulls thesis on GLXY. Galaxy Digital's share was trading a… [+2782 chars]", "https://finance.yahoo.com/news/galaxy-digital-glxy-bull-case-172726384.html", "2025-09-19T17:27:26Z"], ["IT, banks or infra? Top sectors to watch after US Fed rate cut", "With Nifty scaling fresh highs and global markets awaiting the US Feds move, is Indias rally sustainable? In this conversation, Kranthi Bathini, Equity Strategist at WealthMills Securities, shares hi… [+4385 chars]", "https://economictimes.indiatimes.com/markets/expert-view/it-banks-or-infra-top-sectors-to-watch-after-us-fed-rate-cut/articleshow/123978467.cms", "2025-09-19T03:30:00Z"], ["10 Friday AM Reads", "How to Build a Million-Dollar Future for Your Kids: Setting your child up for life doesnt require a windfall just time, consistency and a willingness to think beyond bonds and birthday cards. (Bloomb… [+2764 chars]", "https://ritholtz.com/2025/09/10-friday-am-reads-467/", "2025-09-19T10:30:41Z"], ["Long Bonds Are a Buy as Contagion Fears Ease, TS Lombard Says", "{ window.open(this.href, '_blank'); }, 200); return false;\"&gt;Why did Nvidia invest $5B in Intel? { window.open(this.href, '_blank'); }, 200); return false;\"&gt;What caused ABC to suspend Jimmy Kimm… [+726 chars]", "https://biztoc.com/x/83a69e15c180b684", "2025-09-19T03:53:46Z"], ["Morgan and Williams named Wales players of the year", "Morgan will be a key figure for club and country in the coming months and hopes to reap the rewards from working alongside the likes of Maro Itoje, Tadhg Beirne, Jack Conan and Tom Curry.\r\n\"The Lions… [+1253 chars]", "https://www.bbc.com/sport/rugby-union/articles/cq5j3nxne0eo", "2025-09-19T08:59:06Z"], ["One AI safety guru claims that OpenAI's management could spark a global disaster — \"Everyone will die\" if trends continue", "Over the past few months, concerns have been high around AI safety and privacy amid rising incidents of minors committing suicide after reportedly forming unhealthy bonds and relationships with AI to… [+4425 chars]", "https://www.windowscentral.com/artificial-intelligence/ai-safety-guru-claims-openai-management-could-spark-global-disaster", "2025-09-19T11:20:00Z"], ["Are Magnificent 7 stocks overpriced? Here are alternatives.", "If you know anything about stocks, youve probably heard of the Magnificent Seven.\r\nSeven tech giants Amazon, Apple, Alphabet (Google), Meta, Microsoft, Nvidia and Tesla have driven massive gains on W… [+5768 chars]", "https://www.usatoday.com/story/money/2025/09/19/magnificent-seven-stocks-nvidia-microsoft-apple-sp500/86224670007/", "2025-09-19T09:03:57Z"]]