["{\n  \"is_relevant\": \"not relevant\",\n  \"summary\": \"A software developer created a portfolio analysis tool using Clojure programming language and integrated Large Language Model (LLM) capabilities. The tool utilizes the yfinance API to retrieve financial data from Yahoo Finance.\"\n}", "{\n  \"is_relevant\": \"not relevant\",\n  \"summary\": \"A Clojure-based program is developed to integrate Large Language Models (LLMs) with Yahoo Finance API for portfolio analysis and construction.\"\n}", "{\n  \"is_relevant\": \"not relevant\",\n  \"summary\": \"The article discusses nine Netflix horror shows that non-horror fans may enjoy, highlighting their excellence and appeal beyond the horror genre.\"\n}", "{\n  \"is_relevant\": \"not relevant\",\n  \"summary\": \"The Trump Gold Card is a US visa for individuals who can provide a substantial benefit to the United States, requiring a nonrefundable processing fee and application process.\"\n}", "{\n  \"is_relevant\": \"not relevant\",\n  \"summary\": \"Bloomberg's Mark Gurman reports that some iPhone 17 Pro and iPhone Air colors are prone to scratching. This issue may necessitate the purchase of a protective case for these devices.\"\n}", "{\n  \"is_relevant\": \"not relevant\",\n  \"summary\": \"A lifestyle article discussing the appeal of reading books during the autumn season, suggesting books to read during this time.\"\n}", "{\n  \"is_relevant\": \"somewhat relevant\",\n  \"summary\": \"A growing number of Wall Street icons are advising investors to buy gold, citing its potential as a safe-haven asset and a hedge against inflation and market volatility.\"\n}", "{\n  \"is_relevant\": \"somewhat relevant\",\n  \"summary\": \"US President Trump introduces a new visa program called the 'Golden Visa' or 'Gold Card', which offers a fast-track to residency for wealthy foreigners who invest $1 million in the US. The program aims to attract high-net-worth individuals and their families.\"\n}", "{\n  \"is_relevant\": \"not relevant\",\n  \"summary\": \"The article reviews a horror movie titled 'Night of the Reaper' available on the streaming platform Shudder, discussing its director and subgenre.\"\n}", "{\n  \"is_relevant\": \"not relevant\",\n  \"summary\": \"A user is experiencing issues loading a required part of a website, possibly due to a browser extension, network issues, or browser settings.\"\n}", "{\n  \"is_relevant\": \"somewhat relevant\",\n  \"summary\": \"PayPal's stablecoin PYUSD is expanding its capabilities to move across nine additional blockchains without relying on traditional banking rails.\"\n}", "{\n  \"is_relevant\": \"not relevant\",\n  \"summary\": \"Nepal Rastra Bank publishes the latest foreign exchange rates in Nepal, providing a guide to understanding today's currency exchange rates.\"\n}", "{\n  \"is_relevant\": \"not relevant\",\n  \"summary\": \"Nepal Rastra Bank publishes the latest foreign exchange rates in Nepal, providing a guide to understanding today's currency exchange rates.\"\n}"]