["{\n  \"is_relevant\": \"not relevant\",\n  \"summary\": \"An article discussing ways to secure a financially stable future for children, focusing on time, consistency, and unconventional thinking beyond traditional gifts and investments.\"\n}", "{\n  \"is_relevant\": \"not relevant\",\n  \"summary\": \"TS Lombard suggests that long bonds are a good investment option due to easing contagion fears.\"\n}", "{\n  \"is_relevant\": \"not relevant\",\n  \"summary\": \"Wales players Joe Morgan and Liam Williams have been named the country's players of the year. Morgan hopes to benefit from working with top players in the coming months.\"\n}", "{\n  \"is_relevant\": \"highly relevant\",\n  \"summary\": \"An AI safety expert has expressed concerns that OpenAI's management could lead to a global disaster, citing potential risks of AI-related harm, including minors forming unhealthy relationships with AI.\"\n}", "{\n  \"is_relevant\": \"somewhat relevant\",\n  \"summary\": \"The article discusses the Magnificent 7 stocks, a group of 7 tech giants, and suggests alternative investment options, implying that these stocks may be overpriced.\"\n}", "{\n  \"is_relevant\": \"not relevant\",\n  \"summary\": \"A news article discussing the psychology of trust in AI, its misuse, and the importance of measuring and designing for user confidence in artificial intelligence systems.\"\n}", "{\n  \"is_relevant\": \"relevant\",\n  \"summary\": \"The Bank of Japan announced it will begin unwinding its $250 billion in exchange traded funds (ETFs) and Japanese Real Estate Investment Trusts (JREITs). This decision has caused a market sell-off.\"\n}", "{\n  \"is_relevant\": \"somewhat relevant\",\n  \"summary\": \"Blackstone appointed Katie Keenan as the CEO of its real estate income trust and global head of the Core+ business, following the death of the previous CEO, LePatner, due to a fatal shooting.\"\n}", "{\n  \"is_relevant\": \"not relevant\",\n  \"summary\": \"The article discusses the image of tech executives attending Trump's second inauguration and speculates about their influence and power.\"\n}", "{\n  \"is_relevant\": \"not relevant\",\n  \"summary\": \"Los Angeles Lakers governor Jeanie Buss and president of basketball operations were in Katowice, Poland, where they had a meal. The Lakers' basketball player Luka Doncic's summer performance is discussed in relation to the team and the NBA.\"\n}"]